Esse notebook mostra como consultar o número de tabelas e colunas usando **SELECT**

In [1]:
import sqlite3
import pandas as pd

Conexão com o banco

In [2]:
con = sqlite3.connect('companhiaMB') 
cur = con.cursor() # salva comandos na memória
print('Conectado ao banco!')

Conectado ao banco!

Listar tabelas de uma base

As informações das tabelas então contidas em uma tabela especial chamada sqlite_master.

In [7]:
query = 'SELECT name FROM sqlite_master WHERE type = "table"'

df = pd.read_sql_query(query, con)
df

           name
0  funcionarios

Listar colunas de uma tabela

In [9]:
query = 'SELECT * from funcionarios where 1=0'

df = pd.read_sql_query(query, con)
df

Empty DataFrame
Columns: [PrimeiroNome, UltimoNome, USERID]
Index: []

In [10]:
query = 'SELECT * from funcionarios LIMIT 0'

df = pd.read_sql_query(query, con)
df

Empty DataFrame
Columns: [PrimeiroNome, UltimoNome, USERID]
Index: []

In [14]:
query = 'SELECT * from funcionarios' #lista todos os valores. Não usar em tabelas grandes

df = pd.read_sql_query(query, con)
df

  PrimeiroNome UltimoNome  USERID
0      Matheus     Brasil    1997
1      Vitória      Lopes    1998
2      Eduardo      Silva    2001